Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/mlb.h
/*
 * Component description for MLB
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-05-18T19:14:05Z */
#ifndef _PIC32CZCA80_MLB_COMPONENT_H_
#define _PIC32CZCA80_MLB_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR MLB                                          */
/* ************************************************************************** */

/* -------- MLB_CTRLA : (MLB Offset: 0x00) (R/W 32) MLB Wrapper Control Register -------- */
#define MLB_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_CTRLA) MLB Wrapper Control Register  Reset Value */

#define MLB_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (MLB_CTRLA) Software Reset Position */
#define MLB_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << MLB_CTRLA_SWRST_Pos)               /* (MLB_CTRLA) Software Reset Mask */
#define MLB_CTRLA_SWRST(value)                (MLB_CTRLA_SWRST_Msk & (_UINT32_(value) << MLB_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the MLB_CTRLA register */
#define MLB_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (MLB_CTRLA) MediaLB Enable (ON) bit Position */
#define MLB_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << MLB_CTRLA_ENABLE_Pos)              /* (MLB_CTRLA) MediaLB Enable (ON) bit Mask */
#define MLB_CTRLA_ENABLE(value)               (MLB_CTRLA_ENABLE_Msk & (_UINT32_(value) << MLB_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the MLB_CTRLA register */
#define MLB_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (MLB_CTRLA) Run In Standby Position */
#define MLB_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << MLB_CTRLA_RUNSTDBY_Pos)            /* (MLB_CTRLA) Run In Standby Mask */
#define MLB_CTRLA_RUNSTDBY(value)             (MLB_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << MLB_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the MLB_CTRLA register */
#define MLB_CTRLA_Msk                         _UINT32_(0x00000043)                                 /* (MLB_CTRLA) Register Mask  */


/* -------- MLB_INTENCLR : (MLB Offset: 0x10) (R/W 32) Interrupt Enable Clear Register -------- */
#define MLB_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (MLB_INTENCLR) Interrupt Enable Clear Register  Reset Value */

#define MLB_INTENCLR_INTMLB_Pos               _UINT32_(0)                                          /* (MLB_INTENCLR) MLB General Interrupt Enable Clear Position */
#define MLB_INTENCLR_INTMLB_Msk               (_UINT32_(0x1) << MLB_INTENCLR_INTMLB_Pos)           /* (MLB_INTENCLR) MLB General Interrupt Enable Clear Mask */
#define MLB_INTENCLR_INTMLB(value)            (MLB_INTENCLR_INTMLB_Msk & (_UINT32_(value) << MLB_INTENCLR_INTMLB_Pos)) /* Assigment of value for INTMLB in the MLB_INTENCLR register */
#define MLB_INTENCLR_INT0AHB_Pos              _UINT32_(1)                                          /* (MLB_INTENCLR) AHB Interrupt 0 Enable Clear Position */
#define MLB_INTENCLR_INT0AHB_Msk              (_UINT32_(0x1) << MLB_INTENCLR_INT0AHB_Pos)          /* (MLB_INTENCLR) AHB Interrupt 0 Enable Clear Mask */
#define MLB_INTENCLR_INT0AHB(value)           (MLB_INTENCLR_INT0AHB_Msk & (_UINT32_(value) << MLB_INTENCLR_INT0AHB_Pos)) /* Assigment of value for INT0AHB in the MLB_INTENCLR register */
#define MLB_INTENCLR_INT1AHB_Pos              _UINT32_(2)                                          /* (MLB_INTENCLR) AHB Interrupt 1 Enable Clear Position */
#define MLB_INTENCLR_INT1AHB_Msk              (_UINT32_(0x1) << MLB_INTENCLR_INT1AHB_Pos)          /* (MLB_INTENCLR) AHB Interrupt 1 Enable Clear Mask */
#define MLB_INTENCLR_INT1AHB(value)           (MLB_INTENCLR_INT1AHB_Msk & (_UINT32_(value) << MLB_INTENCLR_INT1AHB_Pos)) /* Assigment of value for INT1AHB in the MLB_INTENCLR register */
#define MLB_INTENCLR_Msk                      _UINT32_(0x00000007)                                 /* (MLB_INTENCLR) Register Mask  */


/* -------- MLB_INTENSET : (MLB Offset: 0x14) (R/W 32) Interrupt Enable Set Register -------- */
#define MLB_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (MLB_INTENSET) Interrupt Enable Set Register  Reset Value */

#define MLB_INTENSET_INTMLB_Pos               _UINT32_(0)                                          /* (MLB_INTENSET) MLB General Interrupt Enable Set Position */
#define MLB_INTENSET_INTMLB_Msk               (_UINT32_(0x1) << MLB_INTENSET_INTMLB_Pos)           /* (MLB_INTENSET) MLB General Interrupt Enable Set Mask */
#define MLB_INTENSET_INTMLB(value)            (MLB_INTENSET_INTMLB_Msk & (_UINT32_(value) << MLB_INTENSET_INTMLB_Pos)) /* Assigment of value for INTMLB in the MLB_INTENSET register */
#define MLB_INTENSET_INT0AHB_Pos              _UINT32_(1)                                          /* (MLB_INTENSET) AHB Interrupt 0 Enable Set Position */
#define MLB_INTENSET_INT0AHB_Msk              (_UINT32_(0x1) << MLB_INTENSET_INT0AHB_Pos)          /* (MLB_INTENSET) AHB Interrupt 0 Enable Set Mask */
#define MLB_INTENSET_INT0AHB(value)           (MLB_INTENSET_INT0AHB_Msk & (_UINT32_(value) << MLB_INTENSET_INT0AHB_Pos)) /* Assigment of value for INT0AHB in the MLB_INTENSET register */
#define MLB_INTENSET_INT1AHB_Pos              _UINT32_(2)                                          /* (MLB_INTENSET) AHB Interrupt 1 Enable Set Position */
#define MLB_INTENSET_INT1AHB_Msk              (_UINT32_(0x1) << MLB_INTENSET_INT1AHB_Pos)          /* (MLB_INTENSET) AHB Interrupt 1 Enable Set Mask */
#define MLB_INTENSET_INT1AHB(value)           (MLB_INTENSET_INT1AHB_Msk & (_UINT32_(value) << MLB_INTENSET_INT1AHB_Pos)) /* Assigment of value for INT1AHB in the MLB_INTENSET register */
#define MLB_INTENSET_Msk                      _UINT32_(0x00000007)                                 /* (MLB_INTENSET) Register Mask  */


/* -------- MLB_INTFLAG : (MLB Offset: 0x18) (R/W 32) Interrupt Status and Clear Register -------- */
#define MLB_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (MLB_INTFLAG) Interrupt Status and Clear Register  Reset Value */

#define MLB_INTFLAG_INTMLB_Pos                _UINT32_(0)                                          /* (MLB_INTFLAG) MLB General Interrupt Flag Position */
#define MLB_INTFLAG_INTMLB_Msk                (_UINT32_(0x1) << MLB_INTFLAG_INTMLB_Pos)            /* (MLB_INTFLAG) MLB General Interrupt Flag Mask */
#define MLB_INTFLAG_INTMLB(value)             (MLB_INTFLAG_INTMLB_Msk & (_UINT32_(value) << MLB_INTFLAG_INTMLB_Pos)) /* Assigment of value for INTMLB in the MLB_INTFLAG register */
#define MLB_INTFLAG_INT0AHB_Pos               _UINT32_(1)                                          /* (MLB_INTFLAG) AHB Interrupt 0 Flag Position */
#define MLB_INTFLAG_INT0AHB_Msk               (_UINT32_(0x1) << MLB_INTFLAG_INT0AHB_Pos)           /* (MLB_INTFLAG) AHB Interrupt 0 Flag Mask */
#define MLB_INTFLAG_INT0AHB(value)            (MLB_INTFLAG_INT0AHB_Msk & (_UINT32_(value) << MLB_INTFLAG_INT0AHB_Pos)) /* Assigment of value for INT0AHB in the MLB_INTFLAG register */
#define MLB_INTFLAG_INT1AHB_Pos               _UINT32_(2)                                          /* (MLB_INTFLAG) AHB Interrupt 1 Flag Position */
#define MLB_INTFLAG_INT1AHB_Msk               (_UINT32_(0x1) << MLB_INTFLAG_INT1AHB_Pos)           /* (MLB_INTFLAG) AHB Interrupt 1 Flag Mask */
#define MLB_INTFLAG_INT1AHB(value)            (MLB_INTFLAG_INT1AHB_Msk & (_UINT32_(value) << MLB_INTFLAG_INT1AHB_Pos)) /* Assigment of value for INT1AHB in the MLB_INTFLAG register */
#define MLB_INTFLAG_Msk                       _UINT32_(0x00000007)                                 /* (MLB_INTFLAG) Register Mask  */


