Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/mlb.h
/* -------- MLB_MDAT3 : (MLB Offset: 0x4CC) (R/W 32) MIF Data 3 Register -------- */
#define MLB_MDAT3_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_MDAT3) MIF Data 3 Register  Reset Value */

#define MLB_MDAT3_DATA_Pos                    _UINT32_(0)                                          /* (MLB_MDAT3) CTR data - bits[127:96] of 128-bit entry Position */
#define MLB_MDAT3_DATA_Msk                    (_UINT32_(0xFFFFFFFF) << MLB_MDAT3_DATA_Pos)         /* (MLB_MDAT3) CTR data - bits[127:96] of 128-bit entry Mask */
#define MLB_MDAT3_DATA(value)                 (MLB_MDAT3_DATA_Msk & (_UINT32_(value) << MLB_MDAT3_DATA_Pos)) /* Assigment of value for DATA in the MLB_MDAT3 register */
#define MLB_MDAT3_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_MDAT3) Register Mask  */


/* -------- MLB_MDWE0 : (MLB Offset: 0x4D0) (R/W 32) MIF Data Write Enable 0 Register -------- */
#define MLB_MDWE0_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_MDWE0) MIF Data Write Enable 0 Register  Reset Value */

#define MLB_MDWE0_MASK_Pos                    _UINT32_(0)                                          /* (MLB_MDWE0) Bitwise write enable for CTR data - bits[31:0] (0 = disabled, 1 = enabled) Position */
#define MLB_MDWE0_MASK_Msk                    (_UINT32_(0xFFFFFFFF) << MLB_MDWE0_MASK_Pos)         /* (MLB_MDWE0) Bitwise write enable for CTR data - bits[31:0] (0 = disabled, 1 = enabled) Mask */
#define MLB_MDWE0_MASK(value)                 (MLB_MDWE0_MASK_Msk & (_UINT32_(value) << MLB_MDWE0_MASK_Pos)) /* Assigment of value for MASK in the MLB_MDWE0 register */
#define MLB_MDWE0_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_MDWE0) Register Mask  */


/* -------- MLB_MDWE1 : (MLB Offset: 0x4D4) (R/W 32) MIF Data Write Enable 1 Register -------- */
#define MLB_MDWE1_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_MDWE1) MIF Data Write Enable 1 Register  Reset Value */

#define MLB_MDWE1_MASK_Pos                    _UINT32_(0)                                          /* (MLB_MDWE1) Bitwise write enable for CTR data - bits[63:32] (0 = disabled, 1 = enabled) Position */
#define MLB_MDWE1_MASK_Msk                    (_UINT32_(0xFFFFFFFF) << MLB_MDWE1_MASK_Pos)         /* (MLB_MDWE1) Bitwise write enable for CTR data - bits[63:32] (0 = disabled, 1 = enabled) Mask */
#define MLB_MDWE1_MASK(value)                 (MLB_MDWE1_MASK_Msk & (_UINT32_(value) << MLB_MDWE1_MASK_Pos)) /* Assigment of value for MASK in the MLB_MDWE1 register */
#define MLB_MDWE1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_MDWE1) Register Mask  */


/* -------- MLB_MDWE2 : (MLB Offset: 0x4D8) (R/W 32) MIF Data Write Enable 2 Register -------- */
#define MLB_MDWE2_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_MDWE2) MIF Data Write Enable 2 Register  Reset Value */

#define MLB_MDWE2_MASK_Pos                    _UINT32_(0)                                          /* (MLB_MDWE2) Bitwise write enable for CTR data - bits[95:64] (0 = disabled, 1 = enabled) Position */
#define MLB_MDWE2_MASK_Msk                    (_UINT32_(0xFFFFFFFF) << MLB_MDWE2_MASK_Pos)         /* (MLB_MDWE2) Bitwise write enable for CTR data - bits[95:64] (0 = disabled, 1 = enabled) Mask */
#define MLB_MDWE2_MASK(value)                 (MLB_MDWE2_MASK_Msk & (_UINT32_(value) << MLB_MDWE2_MASK_Pos)) /* Assigment of value for MASK in the MLB_MDWE2 register */
#define MLB_MDWE2_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_MDWE2) Register Mask  */


/* -------- MLB_MDWE3 : (MLB Offset: 0x4DC) (R/W 32) MIF Data Write Enable 3 Register -------- */
#define MLB_MDWE3_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_MDWE3) MIF Data Write Enable 3 Register  Reset Value */

#define MLB_MDWE3_MASK_Pos                    _UINT32_(0)                                          /* (MLB_MDWE3) Bitwise write enable for CTR data - bits[127:96] (0 = disabled, 1 = enabled) Position */
#define MLB_MDWE3_MASK_Msk                    (_UINT32_(0xFFFFFFFF) << MLB_MDWE3_MASK_Pos)         /* (MLB_MDWE3) Bitwise write enable for CTR data - bits[127:96] (0 = disabled, 1 = enabled) Mask */
#define MLB_MDWE3_MASK(value)                 (MLB_MDWE3_MASK_Msk & (_UINT32_(value) << MLB_MDWE3_MASK_Pos)) /* Assigment of value for MASK in the MLB_MDWE3 register */
#define MLB_MDWE3_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_MDWE3) Register Mask  */


/* -------- MLB_MCTL : (MLB Offset: 0x4E0) (R/W 32) MIF Control Register -------- */
#define MLB_MCTL_RESETVALUE                   _UINT32_(0x00)                                       /*  (MLB_MCTL) MIF Control Register  Reset Value */

#define MLB_MCTL_XCMP_Pos                     _UINT32_(0)                                          /* (MLB_MCTL) Transfer complete (write 0 to clear) Position */
#define MLB_MCTL_XCMP_Msk                     (_UINT32_(0x1) << MLB_MCTL_XCMP_Pos)                 /* (MLB_MCTL) Transfer complete (write 0 to clear) Mask */
#define MLB_MCTL_XCMP(value)                  (MLB_MCTL_XCMP_Msk & (_UINT32_(value) << MLB_MCTL_XCMP_Pos)) /* Assigment of value for XCMP in the MLB_MCTL register */
#define MLB_MCTL_Msk                          _UINT32_(0x00000001)                                 /* (MLB_MCTL) Register Mask  */


/* -------- MLB_MADR : (MLB Offset: 0x4E4) (R/W 32) MIF Address Register -------- */
#define MLB_MADR_RESETVALUE                   _UINT32_(0x00)                                       /*  (MLB_MADR) MIF Address Register  Reset Value */

#define MLB_MADR_ADDR_Pos                     _UINT32_(0)                                          /* (MLB_MADR) DBR address of 8-bit entry - bits[13:8].CTR address of 128-bit entry or DBR address of 8-bit entry - bits[7:0] Position */
#define MLB_MADR_ADDR_Msk                     (_UINT32_(0x3FFF) << MLB_MADR_ADDR_Pos)              /* (MLB_MADR) DBR address of 8-bit entry - bits[13:8].CTR address of 128-bit entry or DBR address of 8-bit entry - bits[7:0] Mask */
#define MLB_MADR_ADDR(value)                  (MLB_MADR_ADDR_Msk & (_UINT32_(value) << MLB_MADR_ADDR_Pos)) /* Assigment of value for ADDR in the MLB_MADR register */
#define MLB_MADR_TB_Pos                       _UINT32_(30)                                         /* (MLB_MADR) Target location bit (0 = selects CTR, 1 = selects DBR) Position */
#define MLB_MADR_TB_Msk                       (_UINT32_(0x1) << MLB_MADR_TB_Pos)                   /* (MLB_MADR) Target location bit (0 = selects CTR, 1 = selects DBR) Mask */
#define MLB_MADR_TB(value)                    (MLB_MADR_TB_Msk & (_UINT32_(value) << MLB_MADR_TB_Pos)) /* Assigment of value for TB in the MLB_MADR register */
#define MLB_MADR_WNR_Pos                      _UINT32_(31)                                         /* (MLB_MADR) Write-Not-Read selection (0 = read, 1 = write) Position */
#define MLB_MADR_WNR_Msk                      (_UINT32_(0x1) << MLB_MADR_WNR_Pos)                  /* (MLB_MADR) Write-Not-Read selection (0 = read, 1 = write) Mask */
#define MLB_MADR_WNR(value)                   (MLB_MADR_WNR_Msk & (_UINT32_(value) << MLB_MADR_WNR_Pos)) /* Assigment of value for WNR in the MLB_MADR register */
#define MLB_MADR_Msk                          _UINT32_(0xC0003FFF)                                 /* (MLB_MADR) Register Mask  */


/* -------- MLB_ACTL : (MLB Offset: 0x7C0) (R/W 32) AHB Control Register -------- */
#define MLB_ACTL_RESETVALUE                   _UINT32_(0x00)                                       /*  (MLB_ACTL) AHB Control Register  Reset Value */

#define MLB_ACTL_SCE_Pos                      _UINT32_(0)                                          /* (MLB_ACTL) Software clear enable: 0 = Hardware clears interrupt after a ACSRn register read 1 = Software clears interrupt Position */
#define MLB_ACTL_SCE_Msk                      (_UINT32_(0x1) << MLB_ACTL_SCE_Pos)                  /* (MLB_ACTL) Software clear enable: 0 = Hardware clears interrupt after a ACSRn register read 1 = Software clears interrupt Mask */
#define MLB_ACTL_SCE(value)                   (MLB_ACTL_SCE_Msk & (_UINT32_(value) << MLB_ACTL_SCE_Pos)) /* Assigment of value for SCE in the MLB_ACTL register */
#define MLB_ACTL_SMX_Pos                      _UINT32_(1)                                          /* (MLB_ACTL) AHB interrupt mux enable: 0 = ACSR0 generates an interrupt on ahb_int[0]; ACSR1 generates an interrupt on ahb_int[1] 1 = ACSR0 and ACSR1 generate an interrupts on ahb_int[0] only Position */
#define MLB_ACTL_SMX_Msk                      (_UINT32_(0x1) << MLB_ACTL_SMX_Pos)                  /* (MLB_ACTL) AHB interrupt mux enable: 0 = ACSR0 generates an interrupt on ahb_int[0]; ACSR1 generates an interrupt on ahb_int[1] 1 = ACSR0 and ACSR1 generate an interrupts on ahb_int[0] only Mask */
#define MLB_ACTL_SMX(value)                   (MLB_ACTL_SMX_Msk & (_UINT32_(value) << MLB_ACTL_SMX_Pos)) /* Assigment of value for SMX in the MLB_ACTL register */
#define MLB_ACTL_DMAMODE_Pos                  _UINT32_(2)                                          /* (MLB_ACTL) DMA Mode: 0 = DMA Mode 0 1 = DMA Mode 1 Position */
#define MLB_ACTL_DMAMODE_Msk                  (_UINT32_(0x1) << MLB_ACTL_DMAMODE_Pos)              /* (MLB_ACTL) DMA Mode: 0 = DMA Mode 0 1 = DMA Mode 1 Mask */
#define MLB_ACTL_DMAMODE(value)               (MLB_ACTL_DMAMODE_Msk & (_UINT32_(value) << MLB_ACTL_DMAMODE_Pos)) /* Assigment of value for DMAMODE in the MLB_ACTL register */
#define MLB_ACTL_MPB_Pos                      _UINT32_(4)                                          /* (MLB_ACTL) Packet buffering mode: 0 = single-packet mode 1 = multiple-packet mode Position */
#define MLB_ACTL_MPB_Msk                      (_UINT32_(0x1) << MLB_ACTL_MPB_Pos)                  /* (MLB_ACTL) Packet buffering mode: 0 = single-packet mode 1 = multiple-packet mode Mask */
#define MLB_ACTL_MPB(value)                   (MLB_ACTL_MPB_Msk & (_UINT32_(value) << MLB_ACTL_MPB_Pos)) /* Assigment of value for MPB in the MLB_ACTL register */
#define MLB_ACTL_Msk                          _UINT32_(0x00000017)                                 /* (MLB_ACTL) Register Mask  */


/* -------- MLB_ACSR0 : (MLB Offset: 0x7D0) (R/W 32) AHB Channel Status 0 Register -------- */
#define MLB_ACSR0_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_ACSR0) AHB Channel Status 0 Register  Reset Value */

#define MLB_ACSR0_CHS_Pos                     _UINT32_(0)                                          /* (MLB_ACSR0) Interrupt status for logical channels 31 to 0: 0 = None 1 = Interrupt Position */
#define MLB_ACSR0_CHS_Msk                     (_UINT32_(0xFFFFFFFF) << MLB_ACSR0_CHS_Pos)          /* (MLB_ACSR0) Interrupt status for logical channels 31 to 0: 0 = None 1 = Interrupt Mask */
#define MLB_ACSR0_CHS(value)                  (MLB_ACSR0_CHS_Msk & (_UINT32_(value) << MLB_ACSR0_CHS_Pos)) /* Assigment of value for CHS in the MLB_ACSR0 register */
#define MLB_ACSR0_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MLB_ACSR0) Register Mask  */


/* -------- MLB_ACSR1 : (MLB Offset: 0x7D4) (R/W 32) AHB Channel Status 1 Register -------- */
#define MLB_ACSR1_RESETVALUE                  _UINT32_(0x00)                                       /*  (MLB_ACSR1) AHB Channel Status 1 Register  Reset Value */

