Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/mlb.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief MLB register API structure */
typedef struct
{  /* Media Local Bus */
  __IO  uint32_t                       MLB_CTRLA;          /**< Offset: 0x00 (R/W  32) MLB Wrapper Control Register */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       MLB_INTENCLR;       /**< Offset: 0x10 (R/W  32) Interrupt Enable Clear Register */
  __IO  uint32_t                       MLB_INTENSET;       /**< Offset: 0x14 (R/W  32) Interrupt Enable Set Register */
  __IO  uint32_t                       MLB_INTFLAG;        /**< Offset: 0x18 (R/W  32) Interrupt Status and Clear Register */
  __IO  uint32_t                       MLB_DBGCTRL;        /**< Offset: 0x1C (R/W  32) Debug Control Register */
  __I   uint32_t                       MLB_SYNCBUSY;       /**< Offset: 0x20 (R/   32) SYNCBUSY Register */
  __I   uint8_t                        Reserved2[0x3DC];
  __IO  uint32_t                       MLB_MLBC0;          /**< Offset: 0x400 (R/W  32) MediaLB Control 0 Register */
  __I   uint8_t                        Reserved3[0x08];
  __IO  uint32_t                       MLB_MS0;            /**< Offset: 0x40C (R/W  32) MediaLB Channel Status 0 Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       MLB_MS1;            /**< Offset: 0x414 (R/W  32) MediaLB Channel Status 1 Register */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       MLB_MSS;            /**< Offset: 0x420 (R/W  32) MediaLB System Status Register */
  __I   uint32_t                       MLB_MSD;            /**< Offset: 0x424 (R/   32) MediaLB System Data Register (Read-only) */
  __I   uint8_t                        Reserved6[0x04];
  __IO  uint32_t                       MLB_MIEN;           /**< Offset: 0x42C (R/W  32) MediaLB Interrupt Enable Register */
  __I   uint8_t                        Reserved7[0x0C];
  __IO  uint32_t                       MLB_MLBC1;          /**< Offset: 0x43C (R/W  32) MediaLB Control 1 Register */
  __I   uint8_t                        Reserved8[0x40];
  __IO  uint32_t                       MLB_HCTL;           /**< Offset: 0x480 (R/W  32) HBI Control Register */
  __I   uint8_t                        Reserved9[0x04];
  __IO  uint32_t                       MLB_HCMR0;          /**< Offset: 0x488 (R/W  32) HBI Channel Mask 0 Register */
  __IO  uint32_t                       MLB_HCMR1;          /**< Offset: 0x48C (R/W  32) HBI Channel Mask 1 Register */
  __IO  uint32_t                       MLB_HCER0;          /**< Offset: 0x490 (R/W  32) HBI Channel Error 0 Register */
  __IO  uint32_t                       MLB_HCER1;          /**< Offset: 0x494 (R/W  32) HBI Channel Error 1 Register */
  __I   uint32_t                       MLB_HCBR0;          /**< Offset: 0x498 (R/   32) HBI Channel Busy 0 Register */
  __I   uint32_t                       MLB_HCBR1;          /**< Offset: 0x49C (R/   32) HBI Channel Busy 1 Register */
  __I   uint8_t                        Reserved10[0x20];
  __IO  uint32_t                       MLB_MDAT0;          /**< Offset: 0x4C0 (R/W  32) MIF Data 0 Register */
  __IO  uint32_t                       MLB_MDAT1;          /**< Offset: 0x4C4 (R/W  32) MIF Data 1 Register */
  __IO  uint32_t                       MLB_MDAT2;          /**< Offset: 0x4C8 (R/W  32) MIF Data 2 Register */
  __IO  uint32_t                       MLB_MDAT3;          /**< Offset: 0x4CC (R/W  32) MIF Data 3 Register */
  __IO  uint32_t                       MLB_MDWE0;          /**< Offset: 0x4D0 (R/W  32) MIF Data Write Enable 0 Register */
  __IO  uint32_t                       MLB_MDWE1;          /**< Offset: 0x4D4 (R/W  32) MIF Data Write Enable 1 Register */
  __IO  uint32_t                       MLB_MDWE2;          /**< Offset: 0x4D8 (R/W  32) MIF Data Write Enable 2 Register */
  __IO  uint32_t                       MLB_MDWE3;          /**< Offset: 0x4DC (R/W  32) MIF Data Write Enable 3 Register */
  __IO  uint32_t                       MLB_MCTL;           /**< Offset: 0x4E0 (R/W  32) MIF Control Register */
  __IO  uint32_t                       MLB_MADR;           /**< Offset: 0x4E4 (R/W  32) MIF Address Register */
  __I   uint8_t                        Reserved11[0x2D8];
  __IO  uint32_t                       MLB_ACTL;           /**< Offset: 0x7C0 (R/W  32) AHB Control Register */
  __I   uint8_t                        Reserved12[0x0C];
  __IO  uint32_t                       MLB_ACSR0;          /**< Offset: 0x7D0 (R/W  32) AHB Channel Status 0 Register */
  __IO  uint32_t                       MLB_ACSR1;          /**< Offset: 0x7D4 (R/W  32) AHB Channel Status 1 Register */
  __IO  uint32_t                       MLB_ACMR0;          /**< Offset: 0x7D8 (R/W  32) AHB Channel Mask 0 Register */
  __IO  uint32_t                       MLB_ACMR1;          /**< Offset: 0x7DC (R/W  32) AHB Channel Mask 1 Register */
} mlb_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CZCA80_MLB_COMPONENT_H_ */
